imported/solids4foam/tutorials/fluidSolidInteraction/beamInCrossFlow/interElasticBeam/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    interface
    {
        type        calculated;
        value       uniform 0;
    }
    outlet
    {
        type        calculated;
        value       uniform 0;
    }
    inlet
    {
        type        calculated;
        value       uniform 0;
    }
    bottom
    {
        type        calculated;
        value       uniform 0;
    }
    top
    {
        type        calculated;
        value       uniform 0;
    }
    left
    {
        type        calculated;
        value       uniform 0;
    }
    symmetry
    {
        type        symmetryPlane;
    }
}


// ************************************************************************* //
