imported/solids4foam/tutorials/fluidSolidInteraction/beamInCrossFlow/interElasticBeam/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Note: this decomposeParDict is not used but is required to be present.
// Instead the decomposition is specified in system/solid/decomposeParDict and
// system/fluid/decomposeParDict

numberOfSubdomains 4;

method          scotch;

// ************************************************************************* //
